In [4]:
import numpy as np
import pandas as pd

#### Creating a DataFrame

In [5]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}
df = pd.DataFrame(data)

In [6]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [7]:
data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]
df2 = pd.DataFrame(data_list)
columns = ['Name', 'Age', 'City', 'Salary']
df2 = pd.DataFrame(data_list, columns=columns)

In [8]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

#### Selection and indexing of column

In [9]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [10]:
df2['City']

0    New York
1       Paris
2      Berlin
3      London
Name: City, dtype: str

In [11]:
df2[["Name", "City"]]

    Name      City
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

#### Creating a new column

In [12]:
df2["Designation"] = ["Engineer", "Manager", "Analyst", "Director"]

In [13]:
df2

    Name  Age      City  Salary Designation
0   John   28  New York   65000    Engineer
1   Anna   34     Paris   70000     Manager
2  Peter   29    Berlin   62000     Analyst
3  Linda   42    London   85000    Director

In [14]:
df2.drop("City", axis=1)
# Use implace=True to make the changes permanent

    Name  Age  Salary Designation
0   John   28   65000    Engineer
1   Anna   34   70000     Manager
2  Peter   29   62000     Analyst
3  Linda   42   85000    Director

In [15]:
df2.drop(0, axis=0)

    Name  Age    City  Salary Designation
1   Anna   34   Paris   70000     Manager
2  Peter   29  Berlin   62000     Analyst
3  Linda   42  London   85000    Director

#### Selecting Rows

In [16]:
df2

    Name  Age      City  Salary Designation
0   John   28  New York   65000    Engineer
1   Anna   34     Paris   70000     Manager
2  Peter   29    Berlin   62000     Analyst
3  Linda   42    London   85000    Director

In [17]:
df2.loc[0]

Name               John
Age                  28
City           New York
Salary            65000
Designation    Engineer
Name: 0, dtype: object

In [18]:
df2.loc[[0, 1]]

   Name  Age      City  Salary Designation
0  John   28  New York   65000    Engineer
1  Anna   34     Paris   70000     Manager

In [19]:
df2.iloc[3]

Name              Linda
Age                  42
City             London
Salary            85000
Designation    Director
Name: 3, dtype: object

##### Selecting Subsets of Rows and Columns

In [21]:
df.loc[[0, 1]][['City', 'Salary']]

       City  Salary
0  New York   65000
1     Paris   70000

In [24]:
df2.iloc[[2,3]][['Name', 'Age']]

    Name  Age
2  Peter   29
3  Linda   42

##### Conditional Selection

In [25]:
df2

    Name  Age      City  Salary Designation
0   John   28  New York   65000    Engineer
1   Anna   34     Paris   70000     Manager
2  Peter   29    Berlin   62000     Analyst
3  Linda   42    London   85000    Director

In [ ]:
# I only want to see those people who are older than 30 years

In [26]:
df2[df2['Age'] > 30]

    Name  Age    City  Salary Designation
1   Anna   34   Paris   70000     Manager
3  Linda   42  London   85000    Director

In [ ]:
# I only want people who are older than 30 years and there city must be London

In [27]:
df2[(df2['Age'] > 30) & (df2['City'] == 'London')]

    Name  Age    City  Salary Designation
3  Linda   42  London   85000    Director